myapphero/app/controllers/appointments_controller.rb

  def index
    @appointments1 = Appointment.where(section: 'Mock_1').group('id','time_slot')
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."section" = $1 GROUP BY "appointments"."time_slot", "appointments"."id"  [["section", "Mock_1"]]