myapphero/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" GROUP BY section, time_slot, id
---
  def index
    @appointments = Appointment.all

INSERT INTO "appointments" ("section", "time_slot", "company", "student", "UIN", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 1]]
---
  def destroy
    @appointment.destroy

DELETE FROM "appointments"
---
  def generate
    @studentfinish = []
    Appointment.delete_all