myapphero/app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "contact_person", "contact_email", "sponsor_level", "citizenship", "job_type", "student_level", "rep_1", "rep_2", "rep_3", "rep_4", "rep_5", "rep_6", "intvw_1_rep_no", "intvw_2_rep_no", "clinic_1_rep_no", "clinic_2_rep_no", "clinic_3_rep_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "citizenship" = $1, "job_type" = $2, "intvw_2_rep_no" = $3, "updated_at" = $4 WHERE "companies"."id" = $5  [["citizenship", "US Citizen Only"], ["job_type", "Internship"], ["intvw_2_rep_no", 1], ["updated_at", "2015-04-29 19:43:56.904219"], ["id", 2]]