myapphero/app/controllers/students_controller.rb

INSERT INTO "students" ("name", "UIN", "email", "US_Citizen", "degree", "position_type", "Mock_1", "Mock_2", "Resume_1", "Resume_2", "Resume_3", "Lunch", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "Mock_1" = $1, "Mock_2" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["Mock_1", "10:20am-10:40am"], ["Mock_2", "10:40am-11:00am"], ["updated_at", "2015-04-27 04:05:16.766565"], ["id", 33]]
UPDATE "timeslots" SET "stunum" = $1, "updated_at" = $2 WHERE "timeslots"."id" = $3  [["stunum", 21], ["updated_at", "2015-04-26 00:58:35.676123"], ["id", 2]]
---
  def update
    respond_to do |format|
      temp1, temp2 = set_menu('Mock Interview 1')
      Timeslot.increase_1(temp1, @student.id, 'Mock_1')
      temp1, temp2 = set_menu('Mock Interview 2')
      Timeslot.increase_1(temp1, @student.id, 'Mock_1')
      temp1, temp2 = set_menu('Resume Clinic 1')
      Timeslot.increase_1(temp1, @student.id, 'Resume_1')
      temp1, temp2 = set_menu('Resume Clinic 2')
      Timeslot.increase_1(temp1, @student.id, 'Resume_2')
      temp1, temp2 = set_menu('Resume Clinic 3')
      Timeslot.increase_1(temp1, @student.id, 'Resume_3')
      temp1, temp2 = set_menu('Lunch')
      Timeslot.increase_1(temp1, @student.id, 'Lunch')
      if @student.update(student_params)

SELECT "timeslots".* FROM "timeslots" WHERE (section = 'Mock Interview 1' AND stunum>0)
---
    def set_menu(arg)
      result_slots= Timeslot.where("section = ? AND stunum>0", arg).collect{|item| [item.id, item.slot]}