myapphero/app/controllers/timeslots_controller.rb

SELECT "timeslots".* FROM "timeslots"
---
  def index
    @timeslots = Timeslot.all

INSERT INTO "timeslots" ("att_date", "section", "slot", "stunum", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["att_date", "2015-07-01"], ["section", "Resume Clinic 1"], ["slot", "11:00am-11:20am"], ["stunum", 26], ["created_at", "2015-04-26 00:51:35.869873"], ["updated_at", "2015-04-26 00:51:35.869873"]]
---
  def create
    @timeslot = Timeslot.new(timeslot_params)

    respond_to do |format|
      if @timeslot.save

UPDATE "timeslots" SET "att_date" = $1, "stunum" = $2, "updated_at" = $3 WHERE "timeslots"."id" = $4  [["att_date", "11"], ["stunum", 23], ["updated_at", "2015-04-27 05:01:17.940408"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @timeslot.update(timeslot_params)

DELETE FROM "timeslots" WHERE "timeslots"."id" = $1  [["id", 2]]
---
  def destroy
    @timeslot.destroy

SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_timeslot
      @timeslot = Timeslot.find(params[:id])